In [1]:
import pandas as pd

In [2]:
from pandas import DataFrame, Series

In [3]:
ratings = pd.read_csv('https://raw.githubusercontent.com/harvey11230/Week-7/master/ratings.csv')

In [4]:
ratings

,Name,American Sniper,Edge of Tomorrow,Groundhog Day,Jurassic World,Lost in Translation,Lucy
0,John,5.0,4.0,3,NaN,NaN,4.0
1,Logan,4.0,NaN,3,3.0,NaN,NaN
2,Modesto,NaN,NaN,4,NaN,4.0,4.0
3,Malcolm,NaN,NaN,2,NaN,4.0,NaN
4,Maurice,5.0,4.0,4,2.0,3.0,3.0

# Replaced Index to Name

In [5]:
ratings.set_index(['Name'], inplace=True)

In [6]:
ratings

,American Sniper,Edge of Tomorrow,Groundhog Day,Jurassic World,Lost in Translation,Lucy
Name,,,,,,
John,5.0,4.0,3,NaN,NaN,4.0
Logan,4.0,NaN,3,3.0,NaN,NaN
Modesto,NaN,NaN,4,NaN,4.0,4.0
Malcolm,NaN,NaN,2,NaN,4.0,NaN
Maurice,5.0,4.0,4,2.0,3.0,3.0

# add a additional row to store average value of each columns

In [7]:
ratings.loc['AVERAGE'] = [ratings['American Sniper'].mean(),ratings['Edge of Tomorrow'].mean(),ratings['Groundhog Day'].mean(),ratings['Jurassic World'].mean(),ratings['Lost in Translation'].mean(),ratings['Lucy'].mean(),]

In [8]:
ratings=ratings.round(1)

In [9]:
del ratings.index.name

In [10]:
ratings=ratings.fillna(0)

# replaced the Nan records to 0 and removed the index name

In [11]:
ratings

,American Sniper,Edge of Tomorrow,Groundhog Day,Jurassic World,Lost in Translation,Lucy
John,5.0,4.0,3.0,0.0,0.0,4.0
Logan,4.0,0.0,3.0,3.0,0.0,0.0
Modesto,0.0,0.0,4.0,0.0,4.0,4.0
Malcolm,0.0,0.0,2.0,0.0,4.0,0.0
Maurice,5.0,4.0,4.0,2.0,3.0,3.0
AVERAGE,4.7,4.0,3.2,2.5,3.7,3.7

# Normalization

In [12]:
ratings_norm = (ratings - ratings.mean())/(ratings.max()-ratings.min())

In [13]:
ratings_norm.round(1)

,American Sniper,Edge of Tomorrow,Groundhog Day,Jurassic World,Lost in Translation,Lucy
John,0.4,0.5,-0.1,-0.4,-0.6,0.4
Logan,0.2,-0.5,-0.1,0.6,-0.6,-0.6
Modesto,-0.6,-0.5,0.4,-0.4,0.4,0.4
Malcolm,-0.6,-0.5,-0.6,-0.4,0.4,-0.6
Maurice,0.4,0.5,0.4,0.2,0.1,0.1
AVERAGE,0.3,0.5,0.0,0.4,0.3,0.3

# The advantage of Normalization can make the data of different indicators into a unified magnitude, which can be comprehensively compared and evaluated. The disavatange of Nomalization is new input may change the max() or min() value. Simply, it rescale values into range of [0,1]

# Standardization

In [14]:
ratings_stand = (ratings - ratings.mean())/ratings.std()

In [15]:
ratings_stand.round(1)

,American Sniper,Edge of Tomorrow,Groundhog Day,Jurassic World,Lost in Translation,Lucy
John,0.8,0.9,-0.3,-0.9,-1.3,0.8
Logan,0.4,-0.9,-0.3,1.2,-1.3,-1.3
Modesto,-1.3,-0.9,1.1,-0.9,0.8,0.8
Malcolm,-1.3,-0.9,-1.6,-0.9,0.8,-1.3
Maurice,0.8,0.9,1.1,0.5,0.3,0.3
AVERAGE,0.6,0.9,0.0,0.9,0.6,0.6

# Standarization have a mean of 0 and standard deviation of 1. The distribution of data is standardized to facilitate the next step of data processing. This is mainly used in mechanical learning.